---
kind: type
id: T:Autodesk.Revit.DB.PropertySetElement
source: html/dd2c8fbb-98ec-7249-87f0-542401f490dd.htm
---
# Autodesk.Revit.DB.PropertySetElement

An element that groups together a set of related parameters.

## Syntax (C#)
```csharp
public class PropertySetElement : Element
```